eclipse-archived/kiso/refcontexts/efm32/BSP/source/BSP_BoardSettings.h
/********************************************************************************
* Copyright (c) 2010-2019 Robert Bosch GmbH
*
* This program and the accompanying materials are made available under the
* terms of the Eclipse Public License 2.0 which is available at
* http://www.eclipse.org/legal/epl-2.0.
*
* SPDX-License-Identifier: EPL-2.0
*
* Contributors:
*    Robert Bosch GmbH - initial contribution
*
********************************************************************************/

/**
 * @defgroup BSP_XDK110_BOARD BOARD
 * @ingroup BCDS_HAL_BSP_IMP
 * @{
 * @file
 * @brief Board settings header file
 * @details This file holds static configurations which are meant to be
 * assigned to a peripheral at a certain point in time for the Initialize,
 * Connect, Enable, Disable, Disconnect functions.
 * It is prefered to have only macro definitions in this file so that it
 * contains compile time necessary information only.
 */

#ifndef BoardSettings_H
#define BoardSettings_H
#include "BCDS_HAL.h"

#include "em_chip.h"
#include "em_gpio.h"
#include "em_usb.h"
#include "em_msc.h"
#include "em_cmu.h"
#include "em_usart.h"
#include "em_i2c.h"
#include "em_rtc.h"
#include "em_burtc.h"
#include "em_timer.h"
#include "em_leuart.h"
#include "em_rmu.h"
#include "em_wdog.h"
#include "em_adc.h"
#include "em_aes.h"
#include "em_assert.h"
#include "em_dbg.h"
#include "em_int.h"


#if BCDS_FEATURE_BSP_LORA_SX1272
#ifndef BCDS_BOARD_APLM
#define BCDS_BOARD_APLM	1
#endif
#ifndef BCDS_BOARD_XDK110
#define BCDS_BOARD_XDK110 0
#endif
#else
#ifndef BCDS_BOARD_APLM
#define BCDS_BOARD_APLM	0
#endif
#ifndef BCDS_BOARD_XDK110
#define BCDS_BOARD_XDK110 1
#endif
#endif

#if (1 < (BCDS_BOARD_APLM + BCDS_BOARD_XDK110))
#error "multiple boards defined"
#endif

#ifndef BCDS_FEATURE_TRACEPORT
#define BCDS_FEATURE_TRACEPORT 0
#endif

#if BCDS_BOARD_APLM
#define EFM32_HFXO_FREQ                                                         UINT32_C(28000000)/**< value of the high speed external oscillator */
#else
#define EFM32_HFXO_FREQ                                                         UINT32_C(48000000)/**< value of the high speed external oscillator */
#endif

#define HSE_VALUE                                                               EFM32_HFXO_FREQ
#define BSP_GPIO_INT_EVEN_MASK                                                  0x00005555
#define BSP_GPIO_INT_ODD_MASK                                                   0x0000AAAA
#define BSP_ENABLE                                                              true
#define BSP_DISABLE                                                             false
#define BSP_IO_PIN_LOW                                                          UINT32_C(0)
#define BSP_IO_PIN_HIGH                                                         UINT32_C(1)

/* DMA Controller Interrupt Priority */

#define DMA_INTERRUPT_PRIO                                                      (5)

#define ADC0_CH4_PIN                                                            (4)
#define ADC0_CH4_PORT                                                           (gpioPortD)

#define ADC0_CH5_PIN                                                            (5)
#define ADC0_CH5_PORT                                                           (gpioPortD)

#define ADC0_CH6_PIN                                                            (6)
#define ADC0_CH6_PORT                                                           (gpioPortD)

#define ADC0_CH7_PIN                                                            (7)
#define ADC0_CH7_PORT                                                           (gpioPortD)

#define AKU_OUT_PIN                                                             (4)
#define AKU_OUT_PORT                                                            (gpioPortD)
#define AKU_OUT_MODE                                                            (gpioModePushPullDrive)

////////////////////////////////////////////////////////////////////////////////SENSOR NODE
#define SENSOR_NODE_I2C_BUS                                                     I2C0
#define SENSOR_NODE_I2C_CLOCK                                                   (cmuClock_I2C0)
#define SENSOR_NODE_I2C_IRQn                                                    (I2C0_IRQn)
#define SENSOR_NODE_INTERRUPT_PRIORITY                                          UINT32_C(5)
#define SENSOR_NODE_I2C_PRIORITY                                                UINT32_C(5)

#define VDD_BMA280_PIN                                                          (7)
#define VDD_BMA280_PORT                                                         (gpioPortE)
#define VDD_BMA280_MODE                                                         (gpioModePushPull)

#define VDD_BME280_PIN                                                          (8)
#define VDD_BME280_PORT                                                         (gpioPortE)
#define VDD_BME280_MODE                                                         (gpioModePushPullDrive)

#define VDD_BMG160_PIN                                                          (13)
#define VDD_BMG160_PORT                                                         (gpioPortD)
#define VDD_BMG160_MODE                                                         (gpioModePushPullDrive)

#define VDD_BMI160_PIN                                                          (3)
#define VDD_BMI160_PORT                                                         (gpioPortE)
#define VDD_BMI160_MODE                                                         (gpioModePushPullDrive)

#define VDD_BMM150_PIN                                                          (5)
#define VDD_BMM150_PORT                                                         (gpioPortE)
#define VDD_BMM150_MODE                                                         (gpioModePushPull)

#define VDD_MAX44009_PIN                                                        (6)
#define VDD_MAX44009_PORT                                                       (gpioPortE)
#define VDD_MAX44009_MODE                                                       (gpioModePushPullDrive)

#define BMA280_INT1_PIN                                                         (8)
#define BMA280_INT1_PORT                                                        (gpioPortF)
#define BMA280_INT1_MODE                                                        (gpioModeInputPullFilter)
#define BMA280_INT1_EDGE_RISING                                                 false
#define BMA280_INT1_EDGE_FALLING                                                true

#define BMA280_INT2_PIN                                                         (9)
#define BMA280_INT2_PORT                                                        (gpioPortF)
#define BMA280_INT2_MODE                                                        (gpioModeInputPullFilter)
#define BMA280_INT2_EDGE_RISING                                                 false
#define BMA280_INT2_EDGE_FALLING                                                true

#define BMG160_INT1_PIN                                                         (6)
#define BMG160_INT1_PORT                                                        (gpioPortC)
#define BMG160_INT1_MODE                                                        (gpioModeInputPullFilter)
#define BMG160_INT1_EDGE_RISING                                                 false
#define BMG160_INT1_EDGE_FALLING                                                true

#define BMG160_INT2_PIN                                                         (7)
#define BMG160_INT2_PORT                                                        (gpioPortA)
#define BMG160_INT2_MODE                                                        (gpioModeInputPullFilter)
#define BMG160_INT2_EDGE_RISING                                                 false
#define BMG160_INT2_EDGE_FALLING                                                true

