eclipse-archived/kiso/refcontexts/efm32/BSP/source/BSP_BoardSettings.h
#define BMI160_INT1_PIN                                                         (13)
#define BMI160_INT1_PORT                                                        (gpioPortA)
#define BMI160_INT1_MODE                                                        (gpioModeInputPullFilter)
#define BMI160_INT1_EDGE_RISING                                                 false
#define BMI160_INT1_EDGE_FALLING                                                true

#define BMI160_INT2_PIN                                                         (14)
#define BMI160_INT2_PORT                                                        (gpioPortA)
#define BMI160_INT2_MODE                                                        (gpioModeInputPullFilter)
#define BMI160_INT2_EDGE_RISING                                                 false
#define BMI160_INT2_EDGE_FALLING                                                true

#define BMM150_DRDY_PIN                                                         (15)
#define BMM150_DRDY_PORT                                                        (gpioPortE)
#define BMM150_DRDY_MODE                                                        (gpioModeInputPullFilter)
#define BMM150_DRDY_EDGE_RISING                                                 true
#define BMM150_DRDY_EDGE_FALLING                                                false

#define BMM150_INT_PIN                                                          (12)
#define BMM150_INT_PORT                                                         (gpioPortD)
#define BMM150_INT_MODE                                                         (gpioModeInputPullFilter)
#define BMM150_INT_EDGE_RISING                                                  false
#define BMM150_INT_EDGE_FALLING                                                 true

#define MAX44009_INTN_PIN                                                       (4)
#define MAX44009_INTN_PORT                                                      (gpioPortE)
#define MAX44009_INTN_MODE                                                      (gpioModeInputPullFilter)
#define MAX44009_INTN_EDGE_RISING                                               false
#define MAX44009_INTN_EDGE_FALLING                                              true

#define I2C0_SCL_PIN                                                            (15)
#define I2C0_SCL_PORT                                                           (gpioPortD)
#define I2C0_SCL_MODE                                                           (gpioModeWiredAnd)

#define I2C0_SDA_PIN                                                            (14)
#define I2C0_SDA_PORT                                                           (gpioPortD)
#define I2C0_SDA_MODE                                                           (gpioModeWiredAnd)
////////////////////////////////////////////////////////////////////////////////BT MODULE
#define BT_STARTUP_DELAY_MS                                                     UINT32_C(4)
#define BT_WAKEUP_DELAY_MS                                                      UINT32_C(250)
#define BT_RESET_PROCESSING_DELAY_MS                                            UINT32_C(5)
#define BT_RESET_PULLUP_DELAY_MS                                                UINT32_C(2)
#define BT_TRANSMIT_DISABLE_TIMEOUT_MS                                          UINT32_C(2)

#define BT_UART0_CLOCK                                                          (cmuClock_UART0)
#define BT_UART_RX_IRQn                                                         UART0_RX_IRQn
#define BT_UART_RX_PRIORITY                                                     UINT32_C(5)
#define BT_UART_TX_IRQn                                                         UART0_TX_IRQn
#define BT_UART_TX_PRIORITY                                                     UINT32_C(5)

#define BT_SERIAL_PORT                                                          UART0

#define BT_IRQ_PIN                                                              (11)
#define BT_IRQ_PORT                                                             (gpioPortD)
#define BT_IRQ_MODE                                                             (gpioModeDisabled)

#define BT_RST_PIN                                                              (9)
#define BT_RST_PORT                                                             (gpioPortA)
#define BT_RST_MODE                                                             (gpioModeWiredOr)

#define BT_UART0_RX_PIN                                                         (1)
#define BT_UART0_RX_PORT                                                        (gpioPortE)
#define BT_UART0_RX_MODE                                                        (gpioModeInput)
#define BT_UART0_RX_DMA_CHANNEL                                                 (3)

#define BT_UART0_TX_PIN                                                         (0)
#define BT_UART0_TX_PORT                                                        (gpioPortE)
#define BT_UART0_TX_MODE                                                        (gpioModePushPull)
#define BT_UART0_TX_DMA_CHANNEL                                                 (2)

#define BT_WAKEUP_PIN                                                           (10)
#define BT_WAKEUP_PORT                                                          (gpioPortD)
#define BT_WAKEUP_MODE                                                          (gpioModeWiredOr)
////////////////////////////////////////////////////////////////////////////////CHARGING MODULE

#define CHARGE_ON_UPPER_LIMIT                                                   4650 /* 4200 + 225(H/W signal) mvolt = 4425 + (Error Limit)225 mvolt  = 4650 */
#define CHARGE_ON_LOWER_LIMIT                                                   4300

#define CHARGE_CRITICAL_UPPER_LIMIT                                             3500
#define CHARGE_CRITICAL_LOWER_LIMIT                                             3300

#define CHARGE_LOW_UPPER_LIMIT                                                  3650
#define CHARGE_LOW_LOWER_LIMIT                                                  3500

