eclipse-archived/kiso/refcontexts/efm32/BSP/source/BSP_BoardSettings.h
#define CHARGE_NORMAL_UPPER_LIMIT                                               3925
#define CHARGE_NORMAL_LOWER_LIMIT                                               3650

#define CHARGE_HIGH_UPPER_LIMIT                                                 4300
#define CHARGE_HIGH_LOWER_LIMIT                                                 3925

#define VOUT_SENSE_ADC_PIN                                                      (7)
#define VOUT_SENSE_ADC_PORT                                                     (gpioPortD)

#define CHARGING_SELECT_PIN                                                     (3)
#define CHARGING_SELECT_PORT                                                    (gpioPortD)

#define DBG_SWO_PIN                                                             (2)
#define DBG_SWO_PORT                                                            (gpioPortF)

#define ETM_TCLK_PIN                                                            (6)
#define ETM_TCLK_PORT                                                           (gpioPortA)

#define ETM_TD0_PIN                                                             (2)
#define ETM_TD0_PORT                                                            (gpioPortA)

#define ETM_TD1_PIN                                                             (3)
#define ETM_TD1_PORT                                                            (gpioPortA)

#define ETM_TD2_PIN                                                             (4)
#define ETM_TD2_PORT                                                            (gpioPortA)

#define ETM_TD3_PIN                                                             (5)
#define ETM_TD3_PORT                                                            (gpioPortA)

#define EXT_CS_PIN                                                              (8)
#define EXT_CS_PORT                                                             (gpioPortD)

#define GPIO_EXT1_PIN                                                           (1)
#define GPIO_EXT1_PORT                                                          (gpioPortA)

#define GPIO_EXT2_PIN                                                           (2)
#define GPIO_EXT2_PORT                                                          (gpioPortE)

#define GPIO_SWO_PIN                                                            (2)
#define GPIO_SWO_PORT                                                           (gpioPortF)

#define HFXO_N_PIN                                                              (14)
#define HFXO_N_PORT                                                             (gpioPortB)

#define HFXO_P_PIN                                                              (13)
#define HFXO_P_PORT                                                             (gpioPortB)

#define HFXTAL_N_PIN                                                            (14)
#define HFXTAL_N_PORT                                                           (gpioPortB)

#define HFXTAL_P_PIN                                                            (13)
#define HFXTAL_P_PORT                                                           (gpioPortB)

#define I2C1_SCL_PIN                                                            (12)
#define I2C1_SCL_PORT                                                           (gpioPortB)

#define I2C1_SDA_PIN                                                            (11)
#define I2C1_SDA_PORT                                                           (gpioPortB)

#define KEY1_PIN                                                                (9)
#define KEY1_PORT                                                               (gpioPortE)
#define KEY1_MODE                                                               (gpioModeInputPullFilter)
#define KEY1_PULL                                                               (1)
#define KEY1_EDGE_RISING                                                        true
#define KEY1_EDGE_FALLING                                                       true

#define KEY2_PIN                                                                (14)
#define KEY2_PORT                                                               (gpioPortE)
#define KEY2_MODE                                                               (gpioModeInputPullFilter)
#define KEY2_PULL                                                               (1)
#define KEY2_EDGE_RISING                                                        true
#define KEY2_EDGE_FALLING                                                       true

#define LED_ORANGE_PWM_PIN                                                      (1)
#define LED_ORANGE_PWM_PORT                                                     (gpioPortB)

#define LED_RED_PWM_PIN                                                         (12)
#define LED_RED_PWM_PORT                                                        (gpioPortA)

#define LED_YELLOW_PWM_PIN                                                      (0)
#define LED_YELLOW_PWM_PORT                                                     (gpioPortB)

#define LFXO_N_PIN                                                              (8)
#define LFXO_N_PORT                                                             (gpioPortB)

#define LFXO_P_PIN                                                              (7)
#define LFXO_P_PORT                                                             (gpioPortB)

#define LFXTAL_N_PIN                                                            (8)
#define LFXTAL_N_PORT                                                           (gpioPortB)

#define LFXTAL_P_PIN                                                            (7)
#define LFXTAL_P_PORT                                                           (gpioPortB)

#define PWR_2V5_SNOOZE_PIN                                                      (5)
#define PWR_2V5_SNOOZE_PORT                                                     (gpioPortF)
#define PWR_2V5_SNOOZE_MODE                                                     (gpioModeWiredOr)

#define PWR_3V3_EN_PIN                                                          (11)
#define PWR_3V3_EN_PORT                                                         (gpioPortC)
#define PWR_3V3_EN_MODE                                                         (gpioModePushPull)

