eclipse-archived/kiso/refcontexts/efm32/BSP/source/BSP_BoardSettings.h
//////////////////////////////////////////////////////////////////////////////// SD_CARD
#define USART1_PORT_BASE                                                     	USART1
#define USART1_PERCLK_FREQUENCY                                            		HSE_VALUE
#define USART1_BAUDRATE                                                    		UINT32_C(4000000)

#define SD_CARD_SPI1_CLOCK                                                       (cmuClock_USART1)

#define SDCARD_SPI_TX_DMA_CHANNEL                                               (0)
#define SDCARD_SPI_RX_DMA_CHANNEL                                               (1)

#define SD_CARD_RX_IRQN                                                         USART1_RX_IRQn
#define SD_CARD_RX_INTERRUPT_PRIORITY                                           UINT32_C(5)

#define SD_CARD_TX_IRQN                                                         USART1_TX_IRQn
#define SD_CARD_TX_INTERRUPT_PRIORITY                                           UINT32_C(6)

#define SD_CARD_CS_PIN                                                          (15)
#define SD_CARD_CS_PORT                                                         (gpioPortB)
#define SD_CARD_CS_MODE                                                         (gpioModeWiredAnd)

#define SD_CARD_LS_PIN                                                          (7)
#define SD_CARD_LS_PORT                                                         (gpioPortC)
#define SD_CARD_LS_MODE                                                         (gpioModeWiredAnd)


#define SD_DETECT_PIN                                                           (12)
#define SD_DETECT_PORT                                                          (gpioPortF)
#define SD_DETECT_MODE                                                          (gpioModeInputPullFilter)
#define SD_DETECT_EDGE_RISING                                                   true
#define SD_DETECT_EDGE_FALLING                                                  true

#define SD_CARD_SPI1_MISO_PIN                                                   (1)
#define SD_CARD_SPI1_MISO_PORT                                                  (gpioPortD)
#define SD_CARD_SPI1_MISO_MODE                                                  (gpioModeInput)

#define SD_CARD_SPI1_MOSI_PIN                                                   (0)
#define SD_CARD_SPI1_MOSI_PORT                                                  (gpioPortD)
#define SD_CARD_SPI1_MOSI_MODE                                                  (gpioModePushPull)

#define SD_CARD_SPI1_SCK_PIN                                                    (2)
#define SD_CARD_SPI1_SCK_PORT                                                   (gpioPortD)
#define SD_CARD_SPI1_SCK_MODE                                                   (gpioModePushPull)

////////////////////////////////////////////////////////////////////////////////
#define SPI2_MISO_PIN                                                           (4)
#define SPI2_MISO_PORT                                                          (gpioPortB)

#define SPI2_MOSI_PIN                                                           (3)
#define SPI2_MOSI_PORT                                                          (gpioPortB)

#define SPI2_SCK_PIN                                                            (5)
#define SPI2_SCK_PORT                                                           (gpioPortB)
#define TIM0_CC0_PIN                                                            (0)
#define TIM0_CC0_PORT                                                           (gpioPortA)

#define TIM0_CC1_PIN                                                            (0)
#define TIM0_CC1_PORT                                                           (gpioPortC)

#define TIM0_CC2_PIN                                                            (1)
#define TIM0_CC2_PORT                                                           (gpioPortC)

#define TIM0_CDTI0_PIN                                                          (2)
#define TIM0_CDTI0_PORT                                                         (gpioPortC)

#define TIM0_CDTI1_PIN                                                          (3)
#define TIM0_CDTI1_PORT                                                         (gpioPortC)

#define TIM0_CDTI2_PIN                                                          (4)
#define TIM0_CDTI2_PORT                                                         (gpioPortC)

#define TIM2_CC0_PIN                                                            (8)
#define TIM2_CC0_PORT                                                           (gpioPortC)

#define TIM2_CC1_PIN                                                            (9)
#define TIM2_CC1_PORT                                                           (gpioPortC)

#define TIM2_CC2_PIN                                                            (10)
#define TIM2_CC2_PORT                                                           (gpioPortC)

#define UART0_RX_PIN                                                            (1)
#define UART0_RX_PORT                                                           (gpioPortE)

#define UART0_TX_PIN                                                            (0)
#define UART0_TX_PORT                                                           (gpioPortE)

#define UART1_CTS_PIN                                                           (6)
#define UART1_CTS_PORT                                                          (gpioPortF)

#define UART1_RTS_PIN                                                           (2)
#define UART1_RTS_PORT                                                          (gpioPortB)

#define UART1_RX_PIN                                                            (10)
#define UART1_RX_PORT                                                           (gpioPortB)

#define UART1_TX_PIN                                                            (9)
#define UART1_TX_PORT                                                           (gpioPortB)

