eclipse-archived/kiso/refcontexts/efm32/BSP/source/BSP_BoardSettings.h
#define UNUSED6B_PIN                                                            (6)
#define UNUSED13E_PIN                                                           (13)

#define UNUSED7F_PIN                                                            (7)
#define UNUSED6B_PORT                                                           (gpioPortB)

#define UNUSED13E_PORT                                                          (gpioPortE)
#define UNUSED7F_PORT                                                           (gpioPortF)

#define USART0_CLK_PIN                                                          (12)
#define USART0_CLK_PORT                                                         (gpioPortE)

#define USART0_RX_PIN                                                           (11)
#define USART0_RX_PORT                                                          (gpioPortE)

#define USART0_TX_PIN                                                           (10)
#define USART0_TX_PORT                                                          (gpioPortE)

#define USART1_CLK_PIN                                                          (2)
#define USART1_CLK_PORT                                                         (gpioPortD)

#define USART1_RX_PIN                                                           (1)
#define USART1_RX_PORT                                                          (gpioPortD)

#define USART1_TX_PIN                                                           (0)
#define USART1_TX_PORT                                                          (gpioPortD)

#define USB_DM_PORT                                                             (gpioPortF)
#define USB_DM_PIN                                                              (10)

#define USB_DP_PORT                                                             (gpioPortF)
#define USB_DP_PIN                                                              (11)

#define VDD_AKU_PIN                 (9)
#define VDD_AKU_PORT                (gpioPortD)

//////////////////////////////////////////////////////////////////////////////// WIFI MODULE
#define USART0_PORT_BASE                                                        USART0
#define USART0_PERCLK_FREQUENCY 	                                            HSE_VALUE
#define USART0_BAUDRATE                                                       UINT32_C(10000000)
#define WIFI_SPI0_CLOCK                                                         (cmuClock_USART0)

#define WIFI_SUPPLY_SETTING_DELAY_MS                                            UINT32_C(3)// typical value from vendor datasheet
#define WIFI_PWRON_HW_WAKEUP_DELAY_MS                                           UINT32_C(25)// typical value from vendor datasheet
#define WIFI_INIT_DELAY_MS                                                      UINT32_C(1350)// typical value from vendor datasheet
#define WIFI_MIN_HIB_DELAY_MS                                                   UINT32_C(10)// typical value from vendor datasheet
#define WIFI_HIB_WAKEUP_DELAY_MS                                                UINT32_C(50)// typical value from vendor datasheet
#define WIFI_MIN_RESET_DELAY_MS                                                 UINT32_C(5)// typical value from vendor datasheet
#define WIFI_POWER_OFF_DELAY_MS                                                 UINT32_C(20)// typical value from vendor datasheet

#define WIFI_RX_IRQN                                                            USART0_RX_IRQn
#define WIFI_RX_INTERRUPT_PRIORITY                                              UINT32_C(5)

#define WIFI_TX_INTERRUPT_PRIORITY                                              UINT32_C(6)
#define WIFI_TX_IRQN                                                            USART0_TX_IRQn

#define WIFI_SPI_TX_DMA_CHANNEL                                               (3)
#define WIFI_SPI_RX_DMA_CHANNEL                                               (2)

#define VDD_WIFI_EN_PIN                                                         (8)
#define VDD_WIFI_EN_PORT                                                        (gpioPortA)
#define VDD_WIFI_EN_MODE                                                        (gpioModePushPull)

#define WIFI_CSN_PIN                                                            (5)
#define WIFI_CSN_PORT                                                           (gpioPortC)
#define WIFI_CSN_MODE                                                           (gpioModePushPull)

#define WIFI_INT_PIN                                                            (10)
#define WIFI_INT_PORT                                                           (gpioPortA)
#define WIFI_INT_MODE                                                           (gpioModeInput)
#define WIFI_INT_EDGE_RISING                                                    true
#define WIFI_INT_EDGE_FALLING                                                   false

#define WIFI_NHIB_PIN                                                           (11)
#define WIFI_NHIB_PORT                                                          (gpioPortA)
#define WIFI_NHIB_MODE                                                          (gpioModePushPull)

#define WIFI_NRESET_PIN                                                         (15)
#define WIFI_NRESET_PORT                                                        (gpioPortA)
#define WIFI_NRESET_MODE                                                        (gpioModeWiredAnd)

#define WIFI_SPI0_MISO_PIN                                                      (11)
#define WIFI_SPI0_MISO_PORT                                                     (gpioPortE)
#define WIFI_SPI0_MISO_MODE                                                     (gpioModeInput)

#define WIFI_SPI0_MOSI_PIN                                                      (10)
#define WIFI_SPI0_MOSI_PORT                                                     (gpioPortE)
#define WIFI_SPI0_MOSI_MODE                                                     (gpioModePushPull)

#define WIFI_SPI0_SCK_PIN                                                       (12)
#define WIFI_SPI0_SCK_PORT                                                      (gpioPortE)
#define WIFI_SPI0_SCK_MODE                                                      (gpioModePushPull)


