eclipse-archived/kiso/refcontexts/efm32/BSP/source/BSP_BoardSettings.h
#define LORA_TX_IRQN                                                            USART2_TX_IRQn
#define LORA_TX_INTERRUPT_PRIORITY                                              UINT32_C(5)

#define LORA_RX_IRQN                                                            USART2_RX_IRQn
#define LORA_RX_INTERRUPT_PRIORITY                                              UINT32_C(5)

#define USART2_PORT_BASE                                                        USART2
#define USART2_PERCLK_FREQUENCY                                               	0
#define USART2_BAUDRATE                                                       UINT32_C(7000000)
#define LORA_SPI_CLOCK                                                         (cmuClock_USART2)
#define LORA_ROUTE_LOCATION														0

#define BSP_LoRa_RADIO_DIO_0_PORT												gpioPortC
#define BSP_LoRa_RADIO_DIO_0_PIN												0
#define BSP_LoRa_RADIO_DIO_0_MODE												gpioModeInputPull
#define BSP_LoRa_RADIO_DIO_0_DOUT												0

#define BSP_LoRa_RADIO_DIO_1_PORT												gpioPortB
#define BSP_LoRa_RADIO_DIO_1_PIN												14
#define BSP_LoRa_RADIO_DIO_1_MODE												gpioModeInputPull
#define BSP_LoRa_RADIO_DIO_1_DOUT												0

#define BSP_LoRa_RADIO_DIO_2_PORT												gpioPortB
#define BSP_LoRa_RADIO_DIO_2_PIN												13
#define BSP_LoRa_RADIO_DIO_2_MODE												gpioModeInputPull
#define BSP_LoRa_RADIO_DIO_2_DOUT												0

#define BSP_LoRa_RADIO_DIO_3_PORT												gpioPortB
#define BSP_LoRa_RADIO_DIO_3_PIN												12
#define BSP_LoRa_RADIO_DIO_3_MODE												gpioModeInputPull
#define BSP_LoRa_RADIO_DIO_3_DOUT												0

#define BSP_LoRa_RADIO_MISO_PORT												gpioPortC
#define BSP_LoRa_RADIO_MISO_PIN													3
#define BSP_LoRa_RADIO_MISO_MODE												gpioModeInputPull
#define BSP_LoRa_RADIO_MISO_DOUT												0

#define BSP_LoRa_RADIO_MOSI_PORT												gpioPortC
#define BSP_LoRa_RADIO_MOSI_PIN													2
#define BSP_LoRa_RADIO_MOSI_MODE												gpioModePushPullDrive
#define BSP_LoRa_RADIO_MOSI_DOUT												0

#define BSP_LoRa_RADIO_CLK_PORT													gpioPortC
#define BSP_LoRa_RADIO_CLK_PIN													4
#define BSP_LoRa_RADIO_CLK_MODE													gpioModePushPullDrive
#define BSP_LoRa_RADIO_CLK_DOUT													0

#define BSP_LoRa_RADIO_CS_PORT													gpioPortC
#define BSP_LoRa_RADIO_CS_PIN													5
#define BSP_LoRa_RADIO_CS_MODE													gpioModePushPullDrive
#define BSP_LoRa_RADIO_CS_DOUT													1

#define BSP_SERIAL_LEUART_PORT                                                   (LEUART1)
#define BSP_SERIAL_LEUART_CLOCK												     (cmuClock_LEUART1)
#define BSP_LEUART_CLOCK_SELECT            										 (cmuSelect_LFXO)
#define BSP_LEUART_CLOCKDIV_VALUE          										 (UINT16_C(cmuClkDiv_1))

#define BSP_LEUART_RX_PORT                                                       (gpioPortC)
#define BSP_LEUART_RX_PIN                                                        (UINT16_C(7))
#define BSP_LEUART_RX_MODE                                                       (gpioModeInput)
#define BSP_LEUART_RX_DOUT                                                       (UINT8_C(1))
#define BSP_LEUART_RX_DRIVE_MODE           									     (gpioDriveModeStandard)

#define BSP_LEUART_TX_PORT                                                       (gpioPortC)
#define BSP_LEUART_TX_PIN                                                        (UINT16_C(6))
#define BSP_LEUART_TX_MODE                                                       (gpioModePushPull)
#define BSP_LEUART_TX_DOUT													   	 (UINT8_C(1))
#define BSP_LEUART_TX_DRIVE_MODE           									 	 (gpioDriveModeStandard)

#endif /* BoardSettings_H */

/** @}*/
